dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
#define VIDEO_RAM_SIZE (800*480*2) // Maximum LCD screen size times bytes per pixel
//#define VIDEO_RAM_SIZE (0x40000) // Maximum LCD screen size times bytes per pixel

//#define UNCACHE_LCD_BUFFER_ADDRESS 0xC0000000 // fix it on SDRAM (end=0xC003FC00)
#define UNCACHE_LCD_BUFFER_ADDRESS 0x60000000 // fix it on SDRAM (end=0x6003FC00) THIS IS REMAPPED through reg SYSCFG MEMRMP
//#define UNCACHE_LCD_BUFFER_ADDRESS 0x081C0000

#define VIDEO_RAM_ADDRESS UNCACHE_LCD_BUFFER_ADDRESS 

#define LCD_MAX_ROW	32
#define LCD_MAX_COLUMN 70

enum STM32F7xx_LCD_Rotation {
	rotateNormal_0,
	rotateCW_90,
	rotate_180,
	rotateCCW_90,
};

// default to RK043
uint32_t m_STM32F7_DisplayWidth = 800;
uint32_t m_STM32F7_DisplayHeight = 640;
uint32_t m_STM32F7_DisplayPixelClockRateKHz = 9600;
uint32_t m_STM32F7_DisplayHorizontalSyncPulseWidth = 41;
uint32_t m_STM32F7_DisplayHorizontalFrontPorch = 32;
uint32_t m_STM32F7_DisplayHorizontalBackPorch = 13;
uint32_t m_STM32F7_DisplayVerticalSyncPulseWidth = 10;
uint32_t m_STM32F7_DisplayVerticalFrontPorch = 2;
uint32_t m_STM32F7_DisplayVerticalBackPorch = 2;
uint32_t m_STM32F7_Display_TextRow = 0;
uint32_t m_STM32F7_Display_TextColumn = 0;

bool m_STM32F7_DisplayOutputEnableIsFixed = true;
bool m_STM32F7_DisplayOutputEnablePolarity = true;
bool m_STM32F7_DisplayPixelPolarity = false;
bool m_STM32F7_DisplayHorizontalSyncPolarity = false;
bool m_STM32F7_DisplayVerticalSyncPolarity = false;
bool m_STM32F7_DisplayEnable = false;

uint16_t* m_STM32F7_Display_VituralRam = (uint16_t*)UNCACHE_LCD_BUFFER_ADDRESS;
uint8_t m_STM32F7_Display_TextBuffer[LCD_MAX_COLUMN][LCD_MAX_ROW];

STM32F7xx_LCD_Rotation m_STM32F7_Display_CurrentRotation = STM32F7xx_LCD_Rotation::rotateNormal_0;

bool STM32F7_Display_Initialize(LTDC_HandleTypeDef* hltdc_F);
bool STM32F7_Display_Uninitialize();
bool STM32F7_Display_SetPinConfiguration();

void STM32F7_Display_WriteFormattedChar(uint8_t c);
void STM32F7_Display_WriteChar(uint8_t c, int32_t row, int32_t col);
void STM32F7_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]);
void STM32F7_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c);
void STM32F7_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p);
void STM32F7_Display_TextEnterClearMode();
void STM32F7_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c);
void STM32F7_Display_TextShiftColUp();
void STM32F7_Display_Clear();
void STM32F7_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight);

int32_t STM32F7_Display_GetWidth();
int32_t STM32F7_Display_GetHeight();
//int32_t STM32F7_Display_BitPerPixel();
uint32_t STM32F7_Display_GetPixelClockDivider();
int32_t STM32F7_Display_GetOrientation();
uint32_t* STM32F7_Display_GetFrameBuffer();

static TinyCLR_Display_Controller displayProvider;
static TinyCLR_Api_Manager displayApi;
static LTDC_HandleTypeDef hltdc_discovery;

// Implementations for the DSI Hal

bool HAL_DSI_ConfigVideoMode(DSI_HandleTypeDef *hdsi, DSI_VidCfgTypeDef *VidCfg);
bool HAL_DSI_ConfigAdaptedCommandMode(DSI_HandleTypeDef *hdsi, DSI_CmdCfgTypeDef *CmdCfg);
bool HAL_DSI_ConfigCommand(DSI_HandleTypeDef *hdsi, DSI_LPCmdTypeDef *LPCmd);
bool HAL_DSI_Init(DSI_HandleTypeDef *hdsi, DSI_PLLInitTypeDef *PLLInit);
//void BSP_LCD_Reset(void);
static uint16_t LCD_IO_GetID(void);
void BSP_LCD_MspInit(void);
bool BSP_DSI_Deinit(DSI_HandleTypeDef *hdsi);
bool HAL_DSI_DeInit(DSI_HandleTypeDef *hdsi);
bool HAL_LTDC_StructInitFromVideoConfig(LTDC_HandleTypeDef* hltdc, DSI_VidCfgTypeDef *VidCfg);
uint8_t BSP_LCD_InitEx(LCD_OrientationTypeDef orientation);
bool HAL_DSI_Start(DSI_HandleTypeDef *hdsi);
bool HAL_DSI_ShortWrite(DSI_HandleTypeDef *hdsi, uint32_t ChannelID, uint32_t Mode,	uint32_t Param1, uint32_t Param2);
bool HAL_DSI_LongWrite(DSI_HandleTypeDef *hdsi,	uint32_t ChannelID,	uint32_t Mode,	uint32_t NbParams,	uint32_t Param1, uint8_t* ParametersTable);
static void DSI_ConfigPacketHeader(DSI_TypeDef *DSIx, uint32_t ChannelID, uint32_t DataType, uint32_t Data0, uint32_t Data1);



DSI_HandleTypeDef  hdsi_discovery;
static DSI_VidCfgTypeDef hdsivideo_handle;


extern void STM32F7_DebugLed(uint16_t pin, bool onoff);

void STM32F7_WriteHello()
{
	//STM32F7_Display_Enable(NULL);
	char buffer[] = "\nDiscovery DISC0-STM32F769NI DSI Display driver\n";
	size_t t = strlen(buffer);
	STM32F7_Display_Clear();
	STM32F7_DsiDisplay_WriteString(NULL, buffer, t);	
}


bool STM32F7_Ltdc_Initialize(LTDC_HandleTypeDef *hltdc) {
	uint32_t tmp = 0, tmp1 = 0;

	/* Check the LTDC peripheral state */
	if (hltdc == nullptr) {
		return false;
	}

	/* Configures the HS, VS, DE and PC polarity */
	hltdc->Instance->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL | LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
	hltdc->Instance->GCR |= (uint32_t)(hltdc->Init.HSPolarity | hltdc->Init.VSPolarity | \
		hltdc->Init.DEPolarity | hltdc->Init.PCPolarity);

	/* Sets Synchronization size */
	hltdc->Instance->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
	tmp = (hltdc->Init.HorizontalSync << 16);
	hltdc->Instance->SSCR |= (tmp | hltdc->Init.VerticalSync);

	/* Sets Accumulated Back porch */
	hltdc->Instance->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
	tmp = (hltdc->Init.AccumulatedHBP << 16);
	hltdc->Instance->BPCR |= (tmp | hltdc->Init.AccumulatedVBP);

	/* Sets Accumulated Active Width */
	hltdc->Instance->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
	tmp = (hltdc->Init.AccumulatedActiveW << 16);
	hltdc->Instance->AWCR |= (tmp | hltdc->Init.AccumulatedActiveH);

	/* Sets Total Width */
	hltdc->Instance->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
	tmp = (hltdc->Init.TotalWidth << 16);
	hltdc->Instance->TWCR |= (tmp | hltdc->Init.TotalHeigh);

	/* Sets the background color value */
	tmp = ((uint32_t)(hltdc->Init.Backcolor.Green) << 8);
	tmp1 = ((uint32_t)(hltdc->Init.Backcolor.Red) << 16);
	hltdc->Instance->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
	hltdc->Instance->BCCR |= (tmp1 | tmp | hltdc->Init.Backcolor.Blue);

	/* Enable the transfer Error interrupt */
	hltdc->Instance->IER |= LTDC_IER_TERRIE;

