dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
	/* Enable the FIFO underrun interrupt */
	hltdc->Instance->IER |= LTDC_IER_FUIE;


	/* Enable LTDC by setting LTDCEN bit */
	hltdc->Instance->GCR |= LTDC_GCR_LTDCEN;

	// reload regs immediately
	hltdc->Instance->SRCR = LTDC_SRCR_IMR;

	return true;
}

void STM32F7_Ltdc_SetConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
	uint32_t tmp = 0;
	uint32_t tmp1 = 0;
	uint32_t tmp2 = 0;

	/* Configures the horizontal start and stop position */
	tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16)) << 16);
	LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
	LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16) + 1) | tmp);

	/* Configures the vertical start and stop position */
	tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16);
	LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
	LTDC_LAYER(hltdc, LayerIdx)->WVPCR = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1) | tmp);

	/* Specifies the pixel format */
	LTDC_LAYER(hltdc, LayerIdx)->PFCR &= ~(LTDC_LxPFCR_PF);
	LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);

	/* Configures the default color values */
	tmp = ((uint32_t)(pLayerCfg->Backcolor.Green) << 8);
	tmp1 = ((uint32_t)(pLayerCfg->Backcolor.Red) << 16);
	tmp2 = (pLayerCfg->Alpha0 << 24);
	LTDC_LAYER(hltdc, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED | LTDC_LxDCCR_DCALPHA);
	LTDC_LAYER(hltdc, LayerIdx)->DCCR = (pLayerCfg->Backcolor.Blue | tmp | tmp1 | tmp2);

	/* Specifies the constant alpha value */
	LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
	LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

	/* Specifies the blending factors */
	LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
	LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2);

	/* Color key */
	//LTDC_LAYER(hltdc, LayerIdx)->CKCR &= ~(LTDC_LxCKCR_CKBLUE | LTDC_LxCKCR_CKGREEN | LTDC_LxCKCR_CKRED);
	//LTDC_LAYER(hltdc, LayerIdx)->CKCR = 0x0;

	/* Configures the color frame buffer start address */
	LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
	LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

	if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888) {
		tmp = 4;
	}
	else if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB888) {
		tmp = 3;
	}
	else if ((pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
		(pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
		(pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB1555) || \
		(pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_AL88)) {
		tmp = 2;
	}
	else {
		tmp = 1;
	}

	/* Configures the color frame buffer pitch in byte */
	LTDC_LAYER(hltdc, LayerIdx)->CFBLR &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
	LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((pLayerCfg->ImageWidth * tmp) << 16) | (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * tmp) + 3));

	/* Configures the frame buffer line number */
	LTDC_LAYER(hltdc, LayerIdx)->CFBLNR &= ~(LTDC_LxCFBLNR_CFBLNBR);
	LTDC_LAYER(hltdc, LayerIdx)->CFBLNR = (pLayerCfg->ImageHeight);

	/* Enable LTDC_Layer by setting LEN bit */
	LTDC_LAYER(hltdc, LayerIdx)->CR |= (uint32_t)LTDC_LxCR_LEN;
}


void STM32F7_Ltdc_LayerConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
	
	
	/* Copy new layer configuration into handle structure */
	hltdc->LayerCfg[LayerIdx] = *pLayerCfg;

	/* Configure the LTDC Layer */
	STM32F7_Ltdc_SetConfiguration(hltdc, pLayerCfg, LayerIdx);

	/* Sets the Reload to immediate */
	hltdc->Instance->SRCR = LTDC_SRCR_IMR;
}

bool STM32F7_Display_Initialize(LTDC_HandleTypeDef* hltdc) {
	// InitializeConfiguration
	LTDC_LayerCfgTypeDef      pLayerCfg;

	RCC->CR &= ~(RCC_CR_PLLSAION);
	// Wait for locked bit
	while (RCC->CR & RCC_CR_PLLSAIRDY == 0);

	STM32F7_Time_Delay(nullptr, 0x20000);

	RCC->PLLSAICFGR = (0x180 << 6) | ((0x3) << 16) | ((0xF) << 24) | ((0x7) << 28);

	// LDTC clock set is at 9.5Mhz PLLR/4
	MODIFY_REG(RCC->DCKCFGR1, RCC_DCKCFGR1_PLLSAIDIVR, (uint32_t)(0x00000000));

	//RCC->DCKCFGR1 &= ~(RCC_DCKCFGR1_PLLSAIDIVR);
	//RCC->DCKCFGR1 |= RCC_DCKCFGR1_PLLSAIDIVR_0; // now LDTC clock is at 9.5Mhz 

	RCC->CR |= (RCC_CR_PLLSAION);

	// Wait for unlocked bit
	while (RCC->CR & RCC_CR_PLLSAIRDY != RCC_CR_PLLSAIRDY);

	STM32F7_Time_Delay(nullptr, 0x10000);

	// Activate LTDC
	do {
		RCC->APB2ENR |= RCC_APB2ENR_LTDCEN;
		__IO uint32_t rr = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_LTDCEN);
	} while (0);
	
	//hltdc_F.Init.HSPolarity = LTDC_HSPOLARITY_AL;
	//hltdc_F.Init.VSPolarity = LTDC_VSPOLARITY_AL;
	//hltdc_F.Init.DEPolarity = LTDC_DEPOLARITY_AL;
	//hltdc_F.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

	///* The RK043FN48H LCD 480x272 is selected */
	///* Timing Configuration */
	//hltdc_F.Init.HorizontalSync = (m_STM32F7_DisplayHorizontalSyncPulseWidth - 1);
	//hltdc_F.Init.VerticalSync = (m_STM32F7_DisplayVerticalSyncPulseWidth - 1);
	//hltdc_F.Init.AccumulatedHBP = (m_STM32F7_DisplayHorizontalSyncPulseWidth + m_STM32F7_DisplayHorizontalBackPorch - 1);
	//hltdc_F.Init.AccumulatedVBP = (m_STM32F7_DisplayVerticalSyncPulseWidth + m_STM32F7_DisplayVerticalBackPorch - 1);
	//hltdc_F.Init.AccumulatedActiveH = (m_STM32F7_DisplayHeight + m_STM32F7_DisplayVerticalSyncPulseWidth + m_STM32F7_DisplayVerticalBackPorch - 1);
	//hltdc_F.Init.AccumulatedActiveW = (m_STM32F7_DisplayWidth + m_STM32F7_DisplayHorizontalSyncPulseWidth + m_STM32F7_DisplayHorizontalBackPorch - 1);
	//hltdc_F.Init.TotalHeigh = (m_STM32F7_DisplayHeight + m_STM32F7_DisplayVerticalSyncPulseWidth + m_STM32F7_DisplayVerticalBackPorch + m_STM32F7_DisplayVerticalFrontPorch - 1);
	//hltdc_F.Init.TotalWidth = (m_STM32F7_DisplayWidth + m_STM32F7_DisplayHorizontalSyncPulseWidth + m_STM32F7_DisplayHorizontalBackPorch + m_STM32F7_DisplayHorizontalFrontPorch - 1);
	///* Layer1 Configuration ------------------------------------------------------*/


