dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
	///* Configure R,G,B component values for LCD background color : all black background */
	//hltdc_F.Init.Backcolor.Blue = 0;
	//hltdc_F.Init.Backcolor.Green = 0;
	//hltdc_F.Init.Backcolor.Red = 0;

	hltdc->Instance = LTDC;

	/* Windowing configuration */
	/* In this case all the active display area is used to display a picture then :
	 Horizontal start = horizontal synchronization + Horizontal back porch = 43
	 Vertical start   = vertical synchronization + vertical back porch     = 12
	 Horizontal stop = Horizontal start + window width -1 = 43 + 480 -1
	 Vertical stop   = Vertical start + window height -1  = 12 + 272 -1      */
	pLayerCfg.WindowX0 = 0;
	pLayerCfg.WindowX1 = m_STM32F7_DisplayWidth;
	pLayerCfg.WindowY0 = 0;
	pLayerCfg.WindowY1 = m_STM32F7_DisplayHeight;
	/* Pixel Format configuration*/
	pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
	//pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB888;

	/* Start Address configuration : frame buffer is located at SDRAM memory */
	pLayerCfg.FBStartAdress = (uint32_t)VIDEO_RAM_ADDRESS;

	/* Alpha constant (255 == totally opaque) */
	pLayerCfg.Alpha = 255;

	/* Default Color configuration (configure A,R,G,B component values) : no background color */
	pLayerCfg.Alpha0 = 0; /* fully transparent */
	pLayerCfg.Backcolor.Blue = 0;
	pLayerCfg.Backcolor.Green = 0;
	pLayerCfg.Backcolor.Red = 0;

	/* Configure blending factors */
	pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
	pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
	//pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
	//pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

	/* Configure the number of lines and number of pixels per line */
	//pLayerCfg.ImageWidth = pLayerCfg.WindowX1;
	//pLayerCfg.ImageHeight = pLayerCfg.WindowY1;
	pLayerCfg.ImageWidth = m_STM32F7_DisplayWidth;
	pLayerCfg.ImageHeight = m_STM32F7_DisplayHeight;

	/* Configure the LTDC */
	if (!STM32F7_Ltdc_Initialize(hltdc)) {
		return false;
	}

	/* Configure the Layer*/
	STM32F7_Ltdc_LayerConfiguration(hltdc, &pLayerCfg, 0);

	m_STM32F7_DisplayEnable = true;

	//STM32F7_DebugLed(PIN(J,13), true);
	//STM32F7_Display_Clear();
	return true;
}

bool STM32F7_Display_Uninitialize() {
	m_STM32F7_DisplayEnable = false;

	return true;
}

//====================================================
void STM32F7_Display_WriteFormattedChar(uint8_t c) {
	if (m_STM32F7_DisplayEnable == false)
		return;

	if (c == '\f') {
		STM32F7_Display_Clear();
		STM32F7_Display_TextEnterClearMode();
		m_STM32F7_Display_TextColumn = 0;

		return;
	}

	if (c == '\r') {
		m_STM32F7_Display_TextColumn = 0;

		return;
	}
	if (c == '\n') {
		m_STM32F7_Display_TextColumn = 0;

		if (++m_STM32F7_Display_TextRow >= LCD_MAX_ROW) {
			m_STM32F7_Display_TextRow = LCD_MAX_ROW - 1;
			STM32F7_Display_TextShiftColUp();
		}
		// clean the new line
		for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
			m_STM32F7_Display_TextBuffer[c][m_STM32F7_Display_TextRow] = ' ';
		}

		return;
	}

	STM32F7_Display_PrintChracter(m_STM32F7_Display_TextColumn * 6, m_STM32F7_Display_TextRow * 8, c);
	m_STM32F7_Display_TextBuffer[m_STM32F7_Display_TextColumn][m_STM32F7_Display_TextRow] = c;

	if (++m_STM32F7_Display_TextColumn >= (LCD_MAX_COLUMN - 1)) {
		m_STM32F7_Display_TextColumn = 0;

		if (++m_STM32F7_Display_TextRow >= LCD_MAX_ROW) {
			m_STM32F7_Display_TextRow = LCD_MAX_ROW - 1;
			STM32F7_Display_TextShiftColUp();
		}
		else {
			// clean the new line
			for (c = 0; c < LCD_MAX_COLUMN; c++) {
				m_STM32F7_Display_TextBuffer[c][m_STM32F7_Display_TextRow] = ' ';
			}
		}
	}
}
//=======================================================
void STM32F7_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c) {
	__IO uint16_t* loc;

	if (m_STM32F7_DisplayEnable == false)
		return;

	if (x >= m_STM32F7_DisplayWidth)
		return;
	if (y >= m_STM32F7_DisplayHeight)
		return;

	loc = m_STM32F7_Display_VituralRam + (y * m_STM32F7_DisplayWidth) + x;
	//m_STM32F7_Display_VituralRam + (2 * (y * m_STM32F7_DisplayWidth) + (x));
	if (c)
		*loc = 0x0FFF;
	else
		*loc = 0x0;
}
//=======================================================
void STM32F7_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p) {
	if (m_STM32F7_DisplayEnable == false)
		return;

	for (int32_t i = 0; i < 8; i++) {
		if (p&(1 << i))
			STM32F7_Display_PaintPixel(x, y + i, 1);
		else
			STM32F7_Display_PaintPixel(x, y + i, 0); //clear
	}
}
//===========================================================
void STM32F7_Display_TextEnterClearMode() {
	uint32_t r, c;

	if (m_STM32F7_DisplayEnable == false)
		return;

	STM32F7_Display_Clear();
	m_STM32F7_Display_TextRow = 0;
	m_STM32F7_Display_TextColumn = 0;

	for (r = 0; r < LCD_MAX_ROW; r++) {
		for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
			m_STM32F7_Display_TextBuffer[c][r] = '1';
		}
	}
}
//===========================================================
void STM32F7_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c) {
	uint8_t i;

	if (m_STM32F7_DisplayEnable == false)
		return;

	for (i = 0; i < 5; i++)
		STM32F7_Display_Paint8HorizontalPixels(x + i, y, characters[c][i]);

	STM32F7_Display_Paint8HorizontalPixels(x + i, y, 0);
}

void STM32F7_Display_TextShiftColUp() {
	uint32_t r, c;

	if (m_STM32F7_DisplayEnable == false)
		return;

	// refresh with new data
	STM32F7_Display_Clear();
	m_STM32F7_Display_TextRow = 0;
	m_STM32F7_Display_TextColumn = 0;

	for (r = 0; r < (LCD_MAX_ROW - 1); r++) {
		for (c = 0; c < LCD_MAX_COLUMN - 1; c++) {
			m_STM32F7_Display_TextBuffer[c][r] = m_STM32F7_Display_TextBuffer[c][r + 1];
			STM32F7_Display_WriteFormattedChar(m_STM32F7_Display_TextBuffer[c][r]);
		}
	}
}

void STM32F7_Display_Clear() {
	if (m_STM32F7_DisplayEnable == false)
		return;
	uint32_t len = m_STM32F7_DisplayWidth * m_STM32F7_DisplayHeight * 2;
	uint32_t i = 0;
	uint16_t *ptr_frame_mem;
	ptr_frame_mem = (uint16_t*)VIDEO_RAM_ADDRESS;

	for (i = 0; i < len; i++) {
		*ptr_frame_mem++ = 0x00;
	}

	//memset((uint32_t*)m_STM32F7_Display_VituralRam, 0x8080, len);

