dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
}

//const STM32F7_Gpio_Pin g_Display_ControllerPins[] = STM32F7_DISPLAY_CONTROLLER_PINS;
const STM32F7_Gpio_Pin g_Display_BacklightPin = STM32F7_DISPLAY_BACKLIGHT_PIN;
const STM32F7_Gpio_Pin g_Display_ResetPin = STM32F7_DISPLAY_RESET_PIN;

bool  STM32F7_DsiDisplay_SetPinConfiguration() {

	// Reset need to be HIGH level
	STM32F7_GpioInternal_ConfigurePin(g_Display_ResetPin.number, STM32F7_Gpio_PortMode::GeneralPurposeOutput, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::VeryHigh, STM32F7_Gpio_PullDirection::None, STM32F7_Gpio_AlternateFunction::AF0);
	STM32F7_GpioInternal_WritePin(g_Display_ResetPin.number, true);

	//backlight LCD
	STM32F7_GpioInternal_ConfigurePin(g_Display_BacklightPin.number, STM32F7_Gpio_PortMode::GeneralPurposeOutput, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::VeryHigh, STM32F7_Gpio_PullDirection::None, STM32F7_Gpio_AlternateFunction::AF0);
	STM32F7_GpioInternal_WritePin(g_Display_BacklightPin.number, true);

	return true;
}

bool STM32F7_DsiDisplay_ResetLCD() {
	STM32F7_GpioInternal_ConfigurePin(g_Display_ResetPin.number, STM32F7_Gpio_PortMode::GeneralPurposeOutput, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::VeryHigh, STM32F7_Gpio_PullDirection::None, STM32F7_Gpio_AlternateFunction::AF0);
	STM32F7_GpioInternal_WritePin(g_Display_ResetPin.number, false);
	STM32F7_Time_Delay(nullptr, 100000);
	STM32F7_GpioInternal_WritePin(g_Display_ResetPin.number, true);
}

uint32_t* STM32F7_Display_GetFrameBuffer() {
	return (uint32_t*)m_STM32F7_Display_VituralRam;
}

int32_t STM32F7_Display_GetWidth() {
	int32_t width = m_STM32F7_DisplayWidth;
	int32_t height = m_STM32F7_DisplayHeight;

	STM32F7_Display_GetRotatedDimensions(&width, &height);

	return width;
}

int32_t STM32F7_Display_GetHeight() {
	int32_t width = m_STM32F7_DisplayWidth;
	int32_t height = m_STM32F7_DisplayHeight;

	STM32F7_Display_GetRotatedDimensions(&width, &height);

	return height;
}

uint32_t STM32F7_Display_GetPixelClockDivider() {
	return m_STM32F7_DisplayPixelClockRateKHz;
}
int32_t STM32F7_Display_GetOrientation() {
	return m_STM32F7_Display_CurrentRotation;
}

void  STM32F7_Display_MemCopy(void *dest, void *src, int32_t size) {
	const int32_t MEMCOPY_BYTES_ALIGNED = 8;

	uint64_t *from64 = (uint64_t *)src;
	uint64_t *to64 = (uint64_t *)dest;

	int32_t block = size / MEMCOPY_BYTES_ALIGNED;
	int32_t remainder = size % MEMCOPY_BYTES_ALIGNED;

	while (block > 0) {
		*to64++ = *from64++;
		block--;
	}

	if (remainder > 0) {
		uint8_t *from8 = (uint8_t *)from64;
		uint8_t *to8 = (uint8_t *)to64;

		while (remainder > 0) {
			*to8++ = *from8++;

			remainder--;
		}
	}
}

void STM32F7_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]) {

	int32_t xTo, yTo, xFrom, yFrom;
	int32_t xOffset = x;
	int32_t yOffset = y;
	uint16_t *from = (uint16_t *)data;
	uint16_t *to = (uint16_t *)m_STM32F7_Display_VituralRam;


	int32_t screenWidth = m_STM32F7_DisplayWidth;
	int32_t screenHeight = m_STM32F7_DisplayHeight;
	int32_t startPx, toAddition;

	if (m_STM32F7_DisplayEnable == false)
		return;

	switch (m_STM32F7_Display_CurrentRotation) {
	case STM32F7xx_LCD_Rotation::rotateNormal_0:

		if (xOffset == 0 && yOffset == 0 &&
			width == screenWidth &&    height == screenHeight) {
			STM32F7_Display_MemCopy(to, from, (screenWidth*screenHeight * 2));
		}
		else {
			for (yTo = yOffset; yTo < (yOffset + height); yTo++) {
				STM32F7_Display_MemCopy((void*)(to + yTo * screenWidth + xOffset), (void*)(from + yTo * screenWidth + xOffset), (width * 2));
			}
		}

		break;

	case STM32F7xx_LCD_Rotation::rotateCCW_90:

		startPx = yOffset * screenHeight;
		xFrom = xOffset + width;
		yTo = screenHeight - xOffset - width;
		xTo = yOffset;
		to += yTo * screenWidth + xTo;
		toAddition = screenWidth - height;

		for (; yTo < (screenHeight - xOffset); yTo++) {
			xFrom--;
			yFrom = startPx + xFrom;

			for (xTo = yOffset; xTo < (yOffset + height); xTo++) {
				*to++ = from[yFrom];
				yFrom += screenHeight;
			}

			to += toAddition;
		}

		break;

	case STM32F7xx_LCD_Rotation::rotateCW_90:

		startPx = (yOffset + height - 1) * screenHeight;
		xFrom = xOffset;

		yTo = xOffset;
		xTo = screenWidth - yOffset - height;
		to += yTo * screenWidth + xTo;
		toAddition = screenWidth - height;

		for (; yTo < (xOffset + width); yTo++) {
			yFrom = startPx + xFrom;

			for (xTo = screenWidth - yOffset - height; xTo < (screenWidth - yOffset); xTo++) {
				*to++ = from[yFrom];
				yFrom -= screenHeight;
			}

			to += toAddition;
			xFrom++;
		}

		break;

	case STM32F7xx_LCD_Rotation::rotate_180:

		xFrom = (yOffset + height - 1) * screenWidth + xOffset + width;

		yTo = screenHeight - yOffset - height;
		xTo = screenWidth - xOffset - width;
		to += yTo * screenWidth + xTo;
		toAddition = screenWidth - width;

		for (; yTo < (screenHeight - yOffset); yTo++) {

			for (xTo = screenWidth - xOffset - width; xTo < (screenWidth - xOffset); xTo++) {
				xFrom--;
				*to++ = from[xFrom];
			}

			to += toAddition;
			xFrom -= toAddition;
		}

		break;
	}

}

void STM32F7_Display_WriteChar(uint8_t c, int32_t row, int32_t col) {
	m_STM32F7_Display_TextRow = row;
	m_STM32F7_Display_TextColumn = col;
	STM32F7_Display_WriteFormattedChar(c);

}
void STM32F7_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight) {
	switch (m_STM32F7_Display_CurrentRotation) {
	case STM32F7xx_LCD_Rotation::rotateNormal_0:
	case STM32F7xx_LCD_Rotation::rotate_180:
		*screenWidth = m_STM32F7_DisplayWidth;
		*screenHeight = m_STM32F7_DisplayHeight;
		break;

	case STM32F7xx_LCD_Rotation::rotateCCW_90:
	case STM32F7xx_LCD_Rotation::rotateCW_90:
		*screenWidth = m_STM32F7_DisplayHeight;
		*screenHeight = m_STM32F7_DisplayWidth;
		break;
	}
}


TinyCLR_Result STM32F7_DsiDisplay_Acquire(const TinyCLR_Display_Controller* self, int32_t controller) {
	m_STM32F7_Display_CurrentRotation = STM32F7xx_LCD_Rotation::rotateNormal_0;

	m_STM32F7_Display_VituralRam = (uint16_t*)VIDEO_RAM_ADDRESS;

