dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
	return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_DsiDisplay_Release(const TinyCLR_Display_Controller* self, int32_t controller) {
	if (STM32F7_Display_Uninitialize())
		return TinyCLR_Result::Success;

	return  TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F7_DsiDisplay_Enable(const TinyCLR_Display_Controller* self, int32_t controller) {
	if (!STM32F7_DsiDisplay_SetPinConfiguration()) {
		return TinyCLR_Result::NotSupported;
	}
	auto a = BSP_LCD_InitEx(LCD_OrientationTypeDef::LCD_ORIENTATION_LANDSCAPE);

	return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_DsiDisplay_Disable(const TinyCLR_Display_Controller* self, int32_t controller) {
	return TinyCLR_Result::NotSupported;
}

TinyCLR_Result STM32F7_DsiDisplay_SetConfiguration(const TinyCLR_Display_Controller* self, int32_t controller, TinyCLR_Display_DataFormat dataFormat, uint32_t width, uint32_t height, const void* configuration) { //(const TinyCLR_Display_Provider* self, TinyCLR_Display_DataFormat dataFormat, uint32_t width, uint32_t height, const void* configuration) {
	if (dataFormat != TinyCLR_Display_DataFormat::Rgb565) return TinyCLR_Result::NotSupported;

	m_STM32F7_DisplayWidth = width;
	m_STM32F7_DisplayHeight = height;

	if (configuration != nullptr) {
		
		auto& cfg = *(const TinyCLR_Display_ParallelConfiguration*)configuration;

		m_STM32F7_DisplayOutputEnableIsFixed = cfg.DataEnableIsFixed;
		m_STM32F7_DisplayOutputEnablePolarity = cfg.DataEnablePolarity;
		m_STM32F7_DisplayPixelPolarity = cfg.PixelPolarity;

		m_STM32F7_DisplayPixelClockRateKHz = cfg.PixelClockRate / 1000;

		m_STM32F7_DisplayHorizontalSyncPolarity = cfg.HorizontalSyncPolarity;

		m_STM32F7_DisplayHorizontalSyncPulseWidth = cfg.HorizontalSyncPulseWidth;
		m_STM32F7_DisplayHorizontalFrontPorch = cfg.HorizontalFrontPorch;
		m_STM32F7_DisplayHorizontalBackPorch = cfg.HorizontalBackPorch;

		m_STM32F7_DisplayVerticalSyncPolarity = cfg.VerticalSyncPolarity;

		m_STM32F7_DisplayVerticalSyncPulseWidth = cfg.VerticalSyncPulseWidth;
		m_STM32F7_DisplayVerticalFrontPorch = cfg.VerticalFrontPorch;
		m_STM32F7_DisplayVerticalBackPorch = cfg.VerticalBackPorch;
		m_STM32F7_Display_VituralRam = (uint16_t*)UNCACHE_LCD_BUFFER_ADDRESS;
		
	}
	
	return  TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_DsiDisplay_GetConfiguration(const TinyCLR_Display_Controller* self, int32_t controller, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) { //(const TinyCLR_Display_Provider* self, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) {
	dataFormat = TinyCLR_Display_DataFormat::Rgb565;
	width = m_STM32F7_DisplayWidth;
	height = m_STM32F7_DisplayHeight;

	if (configuration != nullptr) {
		auto& cfg = *(TinyCLR_Display_ParallelConfiguration*)configuration;

		cfg.DataEnableIsFixed = m_STM32F7_DisplayOutputEnableIsFixed;
		cfg.DataEnablePolarity = m_STM32F7_DisplayOutputEnablePolarity;
		cfg.PixelPolarity = m_STM32F7_DisplayPixelPolarity;

		cfg.PixelClockRate = m_STM32F7_DisplayPixelClockRateKHz * 1000;

		cfg.HorizontalSyncPolarity = m_STM32F7_DisplayHorizontalSyncPolarity;

		cfg.HorizontalSyncPulseWidth = m_STM32F7_DisplayHorizontalSyncPulseWidth;
		cfg.HorizontalFrontPorch = m_STM32F7_DisplayHorizontalFrontPorch;
		cfg.HorizontalBackPorch = m_STM32F7_DisplayHorizontalBackPorch;

		cfg.VerticalSyncPolarity = m_STM32F7_DisplayVerticalSyncPolarity;

		cfg.VerticalSyncPulseWidth = m_STM32F7_DisplayVerticalSyncPulseWidth;
		cfg.VerticalFrontPorch = m_STM32F7_DisplayVerticalFrontPorch;
		cfg.VerticalBackPorch = m_STM32F7_DisplayVerticalBackPorch;

	}

	return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F7_DsiDisplay_DrawBuffer(const TinyCLR_Display_Controller* self, int32_t controller, int32_t x, int32_t y, int32_t width, int32_t height, const uint8_t* data) { //(const TinyCLR_Display_Provider* self, int32_t x, int32_t y, int32_t width, int32_t height, const uint8_t* data) {
	STM32F7_Display_BitBltEx(x, y, width, height, (uint32_t*)data);
	return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_DsiDisplay_WriteString(const TinyCLR_Display_Controller* self, int32_t controller, const char* buffer, size_t length) { //(const TinyCLR_Display_Provider* self, const char* buffer, size_t length) {
	for (size_t i = 0; i < length; i++)
		STM32F7_Display_WriteFormattedChar(buffer[i]);

	//STM32F7_DebugLed(true);
	return TinyCLR_Result::Success;
}

TinyCLR_Display_DataFormat dataFormats[] = { TinyCLR_Display_DataFormat::Rgb565 }; // , TinyCLR_Display_DataFormat::Rgb888 };

TinyCLR_Result STM32F7_DsiDisplay_GetCapabilities(const TinyCLR_Display_Controller* self, int32_t controller, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {  //(const TinyCLR_Display_Provider* self, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {
	type = TinyCLR_Display_InterfaceType::Parallel;
	supportedDataFormatCount = SIZEOF_ARRAY(dataFormats);
	supportedDataFormats = dataFormats;

	return TinyCLR_Result::Success;
}

const TinyCLR_Display_Controller* STM32F7_DsiDisplay_GetApi() {
	displayProvider.Parent = &displayApi;
	//displayProvider.Index = 0;
	displayProvider.Acquire = &STM32F7_DsiDisplay_Acquire;
	displayProvider.Release = &STM32F7_DsiDisplay_Release;
	displayProvider.Enable = &STM32F7_DsiDisplay_Enable;
	displayProvider.Disable = &STM32F7_DsiDisplay_Disable;
	displayProvider.SetConfiguration = &STM32F7_DsiDisplay_SetConfiguration;
	displayProvider.GetConfiguration = &STM32F7_DsiDisplay_GetConfiguration;
	displayProvider.GetCapabilities = &STM32F7_DsiDisplay_GetCapabilities;
	displayProvider.DrawBuffer = &STM32F7_DsiDisplay_DrawBuffer;
	displayProvider.WriteString = &STM32F7_DsiDisplay_WriteString;
	
	m_STM32F7_Display_VituralRam = (uint16_t*)UNCACHE_LCD_BUFFER_ADDRESS;

	displayApi.Author = "DB for Discovery-F769NI";
	displayApi.Name = "GHIElectronics.TinyCLR.NativeApis.STM32F7.DisplayProvider";
	displayApi.Type = TinyCLR_Api_Type::DisplayProvider;
	displayApi.Version = 0;
	//displayApi.Count = 1;
	displayApi.Implementation = &displayProvider;
	
	return &displayApi;
}

void STM32F7_DsiDisplay_Reset() {
	STM32F7_Display_Uninitialize();
}


bool HAL_DSI_Init(DSI_HandleTypeDef *hdsi, DSI_PLLInitTypeDef *PLLInit)
{
	uint32_t tickstart = 0;
	uint32_t unitIntervalx4 = 0;
	uint32_t tempIDF = 0;

	/* Check the DSI handle allocation */
	if (hdsi == NULL)
	{
		return false;
	}

