dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
	/*************************End DSI Initialization*******************************/


	/************************LTDC Initialization***********************************/

	hltdc_discovery.Init.HorizontalSync = (HSA - 1);
	hltdc_discovery.Init.AccumulatedHBP = (HSA + HBP - 1);
	hltdc_discovery.Init.AccumulatedActiveW = (lcd_x_size + HSA + HBP - 1);
	hltdc_discovery.Init.TotalWidth = (lcd_x_size + HSA + HBP + HFP - 1);

	/* Initialize the LCD pixel width and pixel height */
	hltdc_discovery.LayerCfg->ImageWidth = lcd_x_size;
	hltdc_discovery.LayerCfg->ImageHeight = lcd_y_size;

	hltdc_discovery.Init.Backcolor.Blue = 0;
	hltdc_discovery.Init.Backcolor.Green = 0;
	hltdc_discovery.Init.Backcolor.Red = 0;
	hltdc_discovery.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
	hltdc_discovery.Instance = LTDC;

	/* Get LTDC Configuration from DSI Configuration */
	HAL_LTDC_StructInitFromVideoConfig(&(hltdc_discovery), &(hdsivideo_handle));

	/* Initialize the LTDC */
	//HAL_LTDC_Init(&hltdc_F);
	STM32F7_Display_Initialize(&hltdc_discovery);

	/* Enable the DSI host and wrapper after the LTDC initialization
	To avoid any synchronization issue, the DSI shall be started after enabling the LTDC */
	HAL_DSI_Start(&hdsi_discovery);

	/* Initialize the font */
	//BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

	/************************End LTDC Initialization*******************************/


	/***********************OTM8009A Initialization********************************/

	/* Initialize the OTM8009A LCD Display IC Driver (KoD LCD IC Driver)
	*  depending on configuration set in 'hdsivideo_handle'.
	*/
	OTM8009A_Init(OTM8009A_FORMAT_RGB888, orientation);

	/***********************End OTM8009A Initialization****************************/

	return LCD_OK;
}

bool HAL_DSI_Start(DSI_HandleTypeDef *hdsi)
{
	/* Process locked */
	//__HAL_LOCK(hdsi);

	/* Enable the DSI host */
	__HAL_DSI_ENABLE(hdsi);

	/* Enable the DSI wrapper */
	__HAL_DSI_WRAPPER_ENABLE(hdsi);

	/* Process unlocked */
	//__HAL_UNLOCK(hdsi);

	return true;
}

/**
* @brief  De-Initializes the BSP LCD Msp
* Application can surcharge if needed this function implementation.
*/
__weak void BSP_LCD_MspDeInit(void)
{

	/** @brief Force and let in reset state LTDC, DMA2D and DSI Host + Wrapper IPs */
	__HAL_RCC_LTDC_FORCE_RESET();
	//__HAL_RCC_DMA2D_FORCE_RESET();
	__HAL_RCC_DSI_FORCE_RESET();

	///** @brief Disable the LTDC, DMA2D and DSI Host and Wrapper clocks */
	__HAL_RCC_LTDC_CLK_DISABLE();
	//__HAL_RCC_DMA2D_CLK_DISABLE();
	__HAL_RCC_DSI_CLK_DISABLE();
}

/**
* @brief  Initialize the BSP LCD Msp.
* Application can surcharge if needed this function implementation
*/
__weak void BSP_LCD_MspInit(void)
{
	/** @brief Enable the LTDC clock */
	__HAL_RCC_LTDC_CLK_ENABLE();

	///** @brief Toggle Sw reset of LTDC IP */
	__HAL_RCC_LTDC_FORCE_RESET();
	__HAL_RCC_LTDC_RELEASE_RESET();

	///** @brief Enable the DMA2D clock */
	//__HAL_RCC_DMA2D_CLK_ENABLE();

	///** @brief Toggle Sw reset of DMA2D IP */
	//__HAL_RCC_DMA2D_FORCE_RESET();
	//__HAL_RCC_DMA2D_RELEASE_RESET();

	///** @brief Enable DSI Host and wrapper clocks */
	__HAL_RCC_DSI_CLK_ENABLE();

	///** @brief Soft Reset the DSI Host and wrapper */
	__HAL_RCC_DSI_FORCE_RESET();
	__HAL_RCC_DSI_RELEASE_RESET();

}

static uint16_t LCD_IO_GetID(void)
{
	// Now it is only for DSI ouput. Can be managed also the case of HDMI chip output with more code
	return LCD_DSI_ID;
}

bool HAL_DSI_DeInit(DSI_HandleTypeDef *hdsi)
{
	/* Check the DSI handle allocation */
	if (hdsi == NULL)
	{
		return false;
	}

	/* Change DSI peripheral state */
	hdsi->State = HAL_DSI_STATE_BUSY;

	/* Disable the DSI wrapper */
	__HAL_DSI_WRAPPER_DISABLE(hdsi);

	/* Disable the DSI host */
	__HAL_DSI_DISABLE(hdsi);

	/* D-PHY clock and digital disable */
	hdsi->Instance->PCTLR &= ~(DSI_PCTLR_CKE | DSI_PCTLR_DEN);

	/* Turn off the DSI PLL */
	__HAL_DSI_PLL_DISABLE(hdsi);

	/* Disable the regulator */
	__HAL_DSI_REG_DISABLE(hdsi);

	/* DeInit the low level hardware */
	//HAL_DSI_MspDeInit(hdsi);

	/* Initialise the error code */
	hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

	/* Initialize the DSI state*/
	hdsi->State = HAL_DSI_STATE_RESET;

	return true;
}

bool HAL_DSI_ConfigVideoMode(DSI_HandleTypeDef *hdsi, DSI_VidCfgTypeDef *VidCfg)
{
	/* Process locked */
	//__HAL_LOCK(hdsi);

	/* Check the LooselyPacked variant only in 18-bit mode */
	if (VidCfg->ColorCoding == DSI_RGB666)
	{
		//assert_param(IS_DSI_LOOSELY_PACKED(VidCfg->LooselyPacked));
	}

	/* Select video mode by resetting CMDM and DSIM bits */
	hdsi->Instance->MCR &= ~DSI_MCR_CMDM;
	hdsi->Instance->WCFGR &= ~DSI_WCFGR_DSIM;

	/* Configure the video mode transmission type */
	hdsi->Instance->VMCR &= ~DSI_VMCR_VMT;
	hdsi->Instance->VMCR |= VidCfg->Mode;

	/* Configure the video packet size */
	hdsi->Instance->VPCR &= ~DSI_VPCR_VPSIZE;
	hdsi->Instance->VPCR |= VidCfg->PacketSize;

	/* Set the chunks number to be transmitted through the DSI link */
	hdsi->Instance->VCCR &= ~DSI_VCCR_NUMC;
	hdsi->Instance->VCCR |= VidCfg->NumberOfChunks;

	/* Set the size of the null packet */
	hdsi->Instance->VNPCR &= ~DSI_VNPCR_NPSIZE;
	hdsi->Instance->VNPCR |= VidCfg->NullPacketSize;

	/* Select the virtual channel for the LTDC interface traffic */
	hdsi->Instance->LVCIDR &= ~DSI_LVCIDR_VCID;
	hdsi->Instance->LVCIDR |= VidCfg->VirtualChannelID;

	/* Configure the polarity of control signals */
	hdsi->Instance->LPCR &= ~(DSI_LPCR_DEP | DSI_LPCR_VSP | DSI_LPCR_HSP);
	hdsi->Instance->LPCR |= (VidCfg->DEPolarity | VidCfg->VSPolarity | VidCfg->HSPolarity);

	/* Select the color coding for the host */
	hdsi->Instance->LCOLCR &= ~DSI_LCOLCR_COLC;
	hdsi->Instance->LCOLCR |= VidCfg->ColorCoding;

	/* Select the color coding for the wrapper */
	hdsi->Instance->WCFGR &= ~DSI_WCFGR_COLMUX;
	hdsi->Instance->WCFGR |= ((VidCfg->ColorCoding) << 1);

	/* Enable/disable the loosely packed variant to 18-bit configuration */
	if (VidCfg->ColorCoding == DSI_RGB666)
	{
		hdsi->Instance->LCOLCR &= ~DSI_LCOLCR_LPE;
		hdsi->Instance->LCOLCR |= VidCfg->LooselyPacked;
	}

