dobova86/TinyCLR_Port/Drivers/DSI_Display_F769/STM32F7_DsiDisplay.cpp
	/* Set the Horizontal Synchronization Active (HSA) in lane byte clock cycles */
	hdsi->Instance->VHSACR &= ~DSI_VHSACR_HSA;
	hdsi->Instance->VHSACR |= VidCfg->HorizontalSyncActive;

	/* Set the Horizontal Back Porch (HBP) in lane byte clock cycles */
	hdsi->Instance->VHBPCR &= ~DSI_VHBPCR_HBP;
	hdsi->Instance->VHBPCR |= VidCfg->HorizontalBackPorch;

	/* Set the total line time (HLINE=HSA+HBP+HACT+HFP) in lane byte clock cycles */
	hdsi->Instance->VLCR &= ~DSI_VLCR_HLINE;
	hdsi->Instance->VLCR |= VidCfg->HorizontalLine;

	/* Set the Vertical Synchronization Active (VSA) */
	hdsi->Instance->VVSACR &= ~DSI_VVSACR_VSA;
	hdsi->Instance->VVSACR |= VidCfg->VerticalSyncActive;

	/* Set the Vertical Back Porch (VBP)*/
	hdsi->Instance->VVBPCR &= ~DSI_VVBPCR_VBP;
	hdsi->Instance->VVBPCR |= VidCfg->VerticalBackPorch;

	/* Set the Vertical Front Porch (VFP)*/
	hdsi->Instance->VVFPCR &= ~DSI_VVFPCR_VFP;
	hdsi->Instance->VVFPCR |= VidCfg->VerticalFrontPorch;

	/* Set the Vertical Active period*/
	hdsi->Instance->VVACR &= ~DSI_VVACR_VA;
	hdsi->Instance->VVACR |= VidCfg->VerticalActive;

	/* Configure the command transmission mode */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPCE;
	hdsi->Instance->VMCR |= VidCfg->LPCommandEnable;

	/* Low power largest packet size */
	hdsi->Instance->LPMCR &= ~DSI_LPMCR_LPSIZE;
	hdsi->Instance->LPMCR |= ((VidCfg->LPLargestPacketSize) << 16);

	/* Low power VACT largest packet size */
	hdsi->Instance->LPMCR &= ~DSI_LPMCR_VLPSIZE;
	hdsi->Instance->LPMCR |= VidCfg->LPVACTLargestPacketSize;

	/* Enable LP transition in HFP period */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPHFPE;
	hdsi->Instance->VMCR |= VidCfg->LPHorizontalFrontPorchEnable;

	/* Enable LP transition in HBP period */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPHBPE;
	hdsi->Instance->VMCR |= VidCfg->LPHorizontalBackPorchEnable;

	/* Enable LP transition in VACT period */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPVAE;
	hdsi->Instance->VMCR |= VidCfg->LPVerticalActiveEnable;

	/* Enable LP transition in VFP period */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPVFPE;
	hdsi->Instance->VMCR |= VidCfg->LPVerticalFrontPorchEnable;

	/* Enable LP transition in VBP period */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPVBPE;
	hdsi->Instance->VMCR |= VidCfg->LPVerticalBackPorchEnable;

	/* Enable LP transition in vertical sync period */
	hdsi->Instance->VMCR &= ~DSI_VMCR_LPVSAE;
	hdsi->Instance->VMCR |= VidCfg->LPVerticalSyncActiveEnable;

	/* Enable the request for an acknowledge response at the end of a frame */
	hdsi->Instance->VMCR &= ~DSI_VMCR_FBTAAE;
	hdsi->Instance->VMCR |= VidCfg->FrameBTAAcknowledgeEnable;

	/* Process unlocked */
	//__HAL_UNLOCK(hdsi);

	return true;
}

bool HAL_LTDC_StructInitFromVideoConfig(LTDC_HandleTypeDef* hltdc, DSI_VidCfgTypeDef *VidCfg)
{
	/* Retrieve signal polarities from DSI */

	/* The following polarity is inverted:
	LTDC_DEPOLARITY_AL <-> LTDC_DEPOLARITY_AH */

	/* Note 1 : Code in line w/ Current LTDC specification */
	hltdc->Init.DEPolarity = (VidCfg->DEPolarity == DSI_DATA_ENABLE_ACTIVE_HIGH) ? LTDC_DEPOLARITY_AL : LTDC_DEPOLARITY_AH;
	hltdc->Init.VSPolarity = (VidCfg->VSPolarity == DSI_VSYNC_ACTIVE_HIGH) ? LTDC_VSPOLARITY_AH : LTDC_VSPOLARITY_AL;
	hltdc->Init.HSPolarity = (VidCfg->HSPolarity == DSI_HSYNC_ACTIVE_HIGH) ? LTDC_HSPOLARITY_AH : LTDC_HSPOLARITY_AL;

	/* Note 2: Code to be used in case LTDC polarities inversion updated in the specification */
	/* hltdc->Init.DEPolarity = VidCfg->DEPolarity << 29;
	hltdc->Init.VSPolarity = VidCfg->VSPolarity << 29;
	hltdc->Init.HSPolarity = VidCfg->HSPolarity << 29; */

	/* Retrieve vertical timing parameters from DSI */
	hltdc->Init.VerticalSync = VidCfg->VerticalSyncActive - 1;
	hltdc->Init.AccumulatedVBP = VidCfg->VerticalSyncActive + VidCfg->VerticalBackPorch - 1;
	hltdc->Init.AccumulatedActiveH = VidCfg->VerticalSyncActive + VidCfg->VerticalBackPorch + VidCfg->VerticalActive - 1;
	hltdc->Init.TotalHeigh = VidCfg->VerticalSyncActive + VidCfg->VerticalBackPorch + VidCfg->VerticalActive + VidCfg->VerticalFrontPorch - 1;

	return true;
}

void DSI_IO_WriteCmd(uint32_t NbrParams, uint8_t *pParams)
{
	if (NbrParams <= 1)
	{
		HAL_DSI_ShortWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
  }
	else
	{
		HAL_DSI_LongWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_LONG_PKT_WRITE, NbrParams, pParams[NbrParams], pParams);
	}
}

bool HAL_DSI_ShortWrite(DSI_HandleTypeDef *hdsi,
	uint32_t ChannelID,
	uint32_t Mode,
	uint32_t Param1,
	uint32_t Param2)
{
	uint32_t tickstart = 0;

	/* Process locked */
	//__HAL_LOCK(hdsi);


	/* Get tick */
	tickstart = 0; //HAL_GetTick();

	/* Wait for Command FIFO Empty */
	while ((hdsi->Instance->GPSR & DSI_GPSR_CMDFE) == 0);

	/* Configure the packet to send a short DCS command with 0 or 1 parameter */
	DSI_ConfigPacketHeader(hdsi->Instance,
		ChannelID,
		Mode,
		Param1,
		Param2);

	/* Process unlocked */
	//__HAL_UNLOCK(hdsi);

	return true;
}

bool HAL_DSI_LongWrite(DSI_HandleTypeDef *hdsi,
	uint32_t ChannelID,
	uint32_t Mode,
	uint32_t NbParams,
	uint32_t Param1,
	uint8_t* ParametersTable)
{
	uint32_t uicounter = 0;
	uint32_t tickstart = 0;

	/* Process locked */
	//__HAL_LOCK(hdsi);
	/* Get tick */
	tickstart = 0; // HAL_GetTick();

	/* Wait for Command FIFO Empty */
	while ((hdsi->Instance->GPSR & DSI_GPSR_CMDFE) == RESET);

	/* Set the DCS code hexadecimal on payload byte 1, and the other parameters on the write FIFO command*/
	while (uicounter < NbParams)
	{
		if (uicounter == 0x00)
		{
			hdsi->Instance->GPDR = (Param1 | \
				((uint32_t)(*(ParametersTable + uicounter)) << 8) | \
				((uint32_t)(*(ParametersTable + uicounter + 1)) << 16) | \
				((uint32_t)(*(ParametersTable + uicounter + 2)) << 24));
			uicounter += 3;
		}
		else
		{
			hdsi->Instance->GPDR = ((uint32_t)(*(ParametersTable + uicounter)) | \
				((uint32_t)(*(ParametersTable + uicounter + 1)) << 8) | \
				((uint32_t)(*(ParametersTable + uicounter + 2)) << 16) | \
				((uint32_t)(*(ParametersTable + uicounter + 3)) << 24));
			uicounter += 4;
		}
	}

	/* Configure the packet to send a long DCS command */
	DSI_ConfigPacketHeader(hdsi->Instance,
		ChannelID,
		Mode,
		((NbParams + 1) & 0x00FF),
		(((NbParams + 1) & 0xFF00) >> 8));

	/* Process unlocked */
	//__HAL_UNLOCK(hdsi);

	return true;
}


static void DSI_ConfigPacketHeader(DSI_TypeDef *DSIx,
	uint32_t ChannelID,
	uint32_t DataType,
	uint32_t Data0,
	uint32_t Data1)
{
	/* Update the DSI packet header with new information */
	DSIx->GHCR = (DataType | (ChannelID << 6) | (Data0 << 8) | (Data1 << 16));
}

void OTM8009A_IO_Delay(uint32_t Delay) {
	STM32F7_Time_Delay(nullptr, Delay * 1000);
}

#endif //INCLUDE_DISPLAY_DSI
